<?php

return [
    'year' => 2025,
    'start_year' => 2011,
    'youtube_api_key' => env('GOOGLE_YOUTUBE_API_KEY'),

    'leagueIds' => [
        1 => 'なでしこ１部リーグ',
        2 => 'なでしこ２部リーグ',
        3 => 'なでしこ１部カップA',
        4 => 'なでしこ１部カップB',
        5 => 'なでしこ２部カップA',
        6 => 'なでしこ２部カップB',
        7  => 'なでしこ１部カップ決勝',
        8  => 'なでしこ２部カップ決勝',
        9  => 'エキサイティングシリーズ 上位リーグ',
        10 => 'エキサイティングシリーズ 下位リーグ',
        11 => 'チャレンジリーグ',
        12 => 'イーストリーグ',
        13 => 'ウエストリーグ',
        14 => 'チャレンジリーグ順位決定戦１−４',
        15 => 'チャレンジリーグ順位決定戦5−8',
        16 => 'チャレンジリーグ順位決定戦9−12',
        17 => 'チャレンジリーグ　プレーオフ',
        18 => 'WEリーグ',
        19 => 'WEリーグカップ　グループA',
        20 => 'WEリーグカップ　グループB',
        21 => 'WEリーグカップ　決勝',
        22 => 'WEリーグクエラシエカップ　グループA',
        23 => 'WEリーグクエラシエ　グループB',
        24 => 'WEリーグクエラシエ　グループC',
        25 => 'WEリーグカップ　決勝',

    ]
];
